/* create directory activity message */
"mkdir %@" = "mkdir %@";

/* delete activity message */
"delete %@" = "delete %@";

/* copy activity message */
"copy %@ to %@" = "copy %@ to %@";

/* move activity message */
"move %@ to %@" = "move %@ to %@";

/* unlock activity message */
"unlock %@" = "unlock %@";

/* lock activity message */
"lock %@" = "lock %@";

/* cat activity message */
"cat %@ revision %@ to %@" = "cat %@ revision %@ to %@";

/* annotate activity message */
"annotate %@ revision %@ to %@" = "annotate %@ revision %@ to %@";

/* diff activity message */
"diff %@ revisions %@:%@ to %@" = "diff %@ revisions %@:%@ to %@";

/* log activity message */
"log %@" = "log %@";

/* error alert title */
"SCM Error" = "SCM Error";

/* BASE revision name */
"BASE" = "BASE";

/* START revision name */
"START" = "START";

/* Top of tree revision name */
"HEAD" = "HEAD";

/* working copy revision name */
"WC" = "WC";

/* local revision name */
"Local" = "Local";

/* unspecified revision name */
"UNSPECIFIED" = "UNSPECIFIED";

/* unspecified connection status */
"No Status" = "No Status";

/* incomplete configuration connection status */
"Incomplete Configuration" = "Incomplete Configuration";

/* missing SCM tool connection status */
"No Executable Tool at Launch Path" = "No Executable Tool at Launch Path";

/* invald URL connection status */
"Invalid URL" = "Invalid URL";

/* connection status while testing connection status */
"Testing Connection..." = "Testing Connection...";

/* host not reachable connection status */
"Host Offline" = "Host Offline";

/* failed to connect status */
"Access Denied" = "Access Denied";

/* connection test passed connection status message*/
"Authenticated" = "Authenticated";

/* invalid connection status message*/
"Internal Error" = "Internal Error";

/* user@host message */
"%@@%@" = "%@@%@";

/* login activity message */
"login %@" = "login %@";

/* logout activity message */
"logout" = "logout";

/* create activity message */
"create %@" = "create %@";

/* list activity message */
"list %@" = "list %@";

/* info activity message */
"info %@" = "info %@";

/* properties activity message */
"properties %@" = "properties %@";

/* checkout activity message */
"checkout %@ to %@" = "checkout %@ to %@";

/* export activity message */
"export %@ to %@" = "export %@ to %@";

/* import activity message */
"import %@ to %@" = "import %@ to %@";

/* default name for new sandbox */
"New Sandbox" = "New Sandbox";

/* status activity message */
"status %@" = "status %@";

/* update activity message */
"update %@ revision %@" = "update %@ revision %@";

/* add activity message */
"add %@" = "add %@";

/* commit activity message */
"commit %@ comment: %@" = "commit %@ comment: %@";

/* edit activity message */
"edit %@" = "edit %@";

/* revert activity message */
"revert %@" = "revert %@";

/* clear tags activity message */
"clear tags %@" = "clear tags %@";

/* resolved activity message */
"resolved %@" = "resolved %@";

/* Added tree update action */
"Added %@" = "Added %@";

/* Removed tree update action */
"Removed %@" = "Removed %@";

/* Reverted tree update action */
"Reverted %@" = "Reverted %@";

/* Updated tree update action */
"Updated %@" = "Updated %@";

/* Skipped tree update action */
"Skipped %@" = "Skipped %@";

/* Copied tree update action */
"Copied %@" = "Copied %@";

/* Restored tree update action */
"Restored %@" = "Restored %@";

/* Statted tree update action */
"Statted %@" = "Statted %@";

/* Cleared tree update action */
"Cleared %@" = "Cleared %@";

/* Completed updating tree update action */
"Completed Updating %@" = "Completed Updating %@";

/* tree update local status */
" status: %@" = " status: %@";

/* tree update revision */
" revision: %@" = " revision: %@";

/* tree update status */
" update: %@" = " update: %@";

/* diff display string */
"Diff %@ vs. %@ - %@" = "Diff %@ vs. %@ — %@";

/* compare display string */
"Compare %@ vs. %@ - %@" = "Compare %@ vs. %@ — %@";

/* annotation display string */
"Annotations for revision %@ - %@" = "Annotations for revision %@ — %@";

/* compare file display string */
"Compare %@ vs. %@" = "Compare %@ vs. %@";
